app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Blade Runner II"], ["rating", "R"], ["updated_at", "2019-10-22 05:29:18.898794"], ["id", 2]]

  def movie_with_same_director
    @similar_movies = Movie.similar_movies(params[:title])
    if @similar_movies.nil?
      flash[:notice]="'#{params[:title]}' has no director info"
      redirect_to movies_path
    end
    @movie = Movie.find_by(title: params[:title])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Chocolat"]]